{"movie":[{"id":"1","image":"https://i.imgur.com/LWRGjot.jpg","name":"Iron Man","storyline":"After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.","director":"Jon Favreau","stars":"Robert Downey Jr., Gwyneth Paltrow, Terrence Howard, Jeff Bridges","release":"2008","duration":"126 min","rating":"7.9"},{"id":"2","image":"https://i.imgur.com/cirLByb.jpg","name":"The Incredible Hulk","storyline":"Bruce Banner, a scientist on the run from the U.S. Government, must find a cure for the monster he turns into, whenever he loses his temper.","director":"Louis Leterrier","stars":"Edward Norton, Liv Tyler, Tim Roth, William Hurt","release":"2008","duration":"112 min","rating":"6.8"},{"id":"3","image":"https://i.imgur.com/8xSajov.jpg","name":"Iron Man 2","storyline":"With the world now aware of his identity as Iron Man, Tony Stark must contend with both his declining health and a vengeful mad man with ties to his father's legacy.","director":"Jon Favreau","stars":"Robert Downey Jr., Mickey Rourke, Gwyneth Paltrow, Don Cheadle","release":"2010","duration":"124 min","rating":"7"},{"id":"4","image":"https://i.imgur.com/nZSXVCi.jpg","name":"Thor","storyline":"The powerful, but arrogant god Thor, is cast out of Asgard to live amongst humans in Midgard (Earth), where he soon becomes one of their finest defenders.","director":"Kenneth Branagh","stars":" Chris Hemsworth, Anthony Hopkins, Natalie Portman, Tom Hiddleston","release":"2011","duration":"115 min","rating":"7"},{"id":"5","image":"https://i.imgur.com/MVxB5W9.jpg","name":"Captain America: The First Avenger","storyline":"Steve Rogers, a rejected military soldier transforms into Captain America after taking a dose of a Super-Soldier serum. But being Captain America comes at a price as he attempts to take down a war monger and a terrorist organization.","director":"Joe Johnston","stars":"Chris Evans, Hugo Weaving, Samuel L. Jackson, Hayley Atwell","release":"2011","duration":"124 min","rating":" 6.9"},{"id":"6","image":"https://i.imgur.com/tFbQCaf.jpg","name":"The Avengers","storyline":"Earth's mightiest heroes must come together and learn to fight as a team if they are going to stop the mischievous Loki and his alien army from enslaving humanity.","director":"Joss Whedon","stars":"Robert Downey Jr., Chris Evans, Scarlett Johansson, Jeremy Renner","release":"2012","duration":"143 min","rating":"8.1"},{"id":"7","image":"https://i.imgur.com/1xUEtmn.jpg","name":"Iron Man 3","storyline":"When Tony Stark's world is torn apart by a formidable terrorist called the Mandarin, he starts an odyssey of rebuilding and retribution.","director":"Shane Black","stars":" Robert Downey Jr., Guy Pearce, Gwyneth Paltrow, Don Cheadle","release":"2013","duration":"130 min","rating":"7.2"},{"id":"8","image":"https://i.imgur.com/f574qv9.jpg","name":"Thor: The Dark World","storyline":"When Dr. Jane Foster gets cursed with a powerful entity known as the Aether, Thor is heralded of the cosmic event known as the Convergence and the genocidal Dark Elves.","director":"Alan Taylor","stars":"Chris Hemsworth, Natalie Portman, Tom Hiddleston, Stellan Skarsgård","release":"2013","duration":"112 min","rating":"7"},{"id":"9","image":"https://i.imgur.com/0skhdBX.jpg","name":"Captain America: The Winter Soldier","storyline":"As Steve Rogers struggles to embrace his role in the modern world, he teams up with a fellow Avenger and S.H.I.E.L.D agent, Black Widow, to battle a new threat from history: an assassin known as the Winter Soldier.","director":"Anthony Russo, Joe Russo","stars":"Chris Evans, Samuel L. Jackson, Scarlett Johansson, Robert Redford","release":"2014","duration":"136 min","rating":"7.8"},{"id":"10","image":"https://i.imgur.com/9ZWCxb2.jpg","name":"Guardians of the Galaxy","storyline":"A group of intergalactic criminals are forced to work together to stop a fanatical warrior from taking control of the universe.","director":"James Gunn","stars":"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe Saldana","release":"2014","duration":"121 min","rating":"8.1"},{"id":"11","image":"https://i.imgur.com/jCY0tz7.jpg","name":"Avengers: Age of Ultron","storyline":"When Tony Stark and Bruce Banner try to jump-start a dormant peacekeeping program called Ultron, things go horribly wrong and it's up to Earth's mightiest heroes to stop the villainous Ultron from enacting his terrible plan.","director":"Joss Whedon","stars":"Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth","release":"2015","duration":"141 min","rating":"7.4"},{"id":"12","image":"https://i.imgur.com/eJzm0Pu.jpg","name":"Ant-Man","storyline":"Armed with a super-suit with the astonishing ability to shrink in scale but increase in strength, cat burglar Scott Lang must embrace his inner hero and help his mentor, Dr. Hank Pym, plan and pull off a heist that will save the world.","director":"Peyton Reed","stars":"Paul Rudd, Michael Douglas, Corey Stoll, Evangeline Lilly","release":"2015","duration":"117 min","rating":"7.3"},{"id":"13","image":"https://i.imgur.com/Nlbvzz5.jpg","name":"Captain America: Civil War","storyline":"Political involvement in the Avengers' activities causes a rift between Captain America and Iron Man.","director":"Anthony Russo, Joe Russo","stars":" Chris Evans, Robert Downey Jr., Scarlett Johansson, Sebastian Stan","release":"2016","duration":"147 min","rating":"7.8"},{"id":"14","image":"https://i.imgur.com/miAhiZS.jpg","name":"Doctor Strange","storyline":"While on a journey of physical and spiritual healing, a brilliant neurosurgeon is drawn into the world of the mystic arts.","director":"Scott Derrickson","stars":"Benedict Cumberbatch, Chiwetel Ejiofor, Rachel McAdams, Benedict Wong","release":"2016","duration":"115 min","rating":"7.5"},{"id":"15","image":"https://i.imgur.com/btQvjk2.jpg","name":"Guardians of the Galaxy Vol. 2","storyline":"The Guardians must fight to keep their newfound family together as they unravel the mystery of Peter Quill's true parentage.","director":"James Gunn","stars":"Chris Pratt, Zoe Saldana, Dave Bautista, Vin Diesel","release":"2017","duration":"136 min","rating":"7.7"},{"id":"16","image":"https://i.imgur.com/BbKmZLk.jpg","name":"Spider-Man: Homecoming","storyline":"Peter Parker balances his life as an ordinary high school student in Queens with his superhero alter-ego Spider-Man, and finds himself on the trail of a new menace prowling the skies of New York City.","director":"Jon Watts","stars":"Tom Holland, Michael Keaton, Robert Downey Jr., Marisa Tomei","release":"2017","duration":"133 min","rating":" 7.5"},{"id":"17","image":"https://i.imgur.com/JenA7bO.jpg","name":"Thor: Ragnarok","storyline":"Thor is imprisoned on the planet Sakaar, and must race against time to return to Asgard and stop Ragnarök, the destruction of his world, at the hands of the powerful and ruthless villain Hela.","director":"Taika Waititi","stars":"Chris Hemsworth, Tom Hiddleston, Cate Blanchett, Mark Ruffalo","release":"2017","duration":"130 min","rating":"7.9"},{"id":"18","image":"https://i.imgur.com/8wBMwfx.jpg","name":"Black Panther","storyline":"T'Challa, heir to the hidden but advanced kingdom of Wakanda, must step forward to lead his people into a new future and must confront a challenger from his country's past.","director":"Ryan Coogler","stars":"Chadwick Boseman, Michael B. Jordan, Lupita Nyong'o, Danai Gurira","release":"2018","duration":"134 min","rating":"7.4"},{"id":"19","image":"https://i.imgur.com/NM9jsgH.jpg","name":"Avengers: Infinity War","storyline":"The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of devastation and ruin puts an end to the universe.","director":"Anthony Russo, Joe Russo","stars":"Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans","release":"2018","duration":"149 min","rating":"8.5"},{"id":"20","image":"https://i.imgur.com/OJ8s6re.jpg","name":"Ant-Man and the Wasp","storyline":"As Scott Lang balances being both a Super Hero and a father, Hope van Dyne and Dr. Hank Pym present an urgent new mission that finds the Ant-Man fighting alongside The Wasp to uncover secrets from their past.","director":"Peyton Reed","stars":"Paul Rudd, Evangeline Lilly, Michael Peña, Walton Goggins","release":"2018","duration":"118min","rating":"7.5"}]}
